perf/results/single-node/endurance/cfg-endurance-async.yaml
config:
  environments:
    async:
      target: 'http://localhost:5555/node/async'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-node"

  pool: 50 # All HTTP requests from all virtual users will be sent over the same connections

  phases:
    - name: Ramp
      duration: 60   # seconds
      arrivalRate: 1
      rampTo: 400
    - name: Plain Line
      duration: 7200 # 2 hours
      arrivalRate: 400
    - name: Reset Line  # useful for resetting Grafana stats
      duration: 60
      arrivalRate: 1

scenarios:
  - name: Root (/)
    flow:
      - get:
          url: '/'